create database web_bms;
use `web_bms`;

## 用户信息表
create table `users`
(
    id       int unsigned auto_increment,
    name     varchar(20) not null,
    account  varchar(20) not null,
    password varchar(20) default '123456',
    sex      varchar(1)  not null,
    college  varchar(30) not null,
    birthday date        not null,
    register datetime    default now(),
    primary key (id)
) default charset = utf8;
# 插入数据
insert into `users`
values (null, '小明', '2019001', '123456', '男', '信息与通信工程学院', '2000-10-19', now());
insert into `users`
values (null, '小王', '2019002', '123456', '男', '信息与通信工程学院', '2022-4-9', now());

## 管理员表
create table `admins`
(
    id       int unsigned auto_increment,
    account  varchar(20) not null,
    password varchar(20) not null,
    primary key (id)
) default charset = utf8;
# 插入数据
insert into `admins`
values (null, 'admin', '123456');

## book type 表
create table `book_type`
(
    id   int unsigned auto_increment,
    type varchar(20) not null,
    primary key (id)
);


insert into `book_type`
values (null, '小说'),
       (null, '历史'),
       (null, '政治'),
       (null, '哲学'),
       (null, '经济'),
       (null, '工程技术'),
       (null, '心理'),
       (null, '互联网'),
       (null, '自然科学');

## books 表
create table `books`
(
    isbn        varchar(20)  not null,
    name        varchar(20)  not null,
    type_id     int unsigned not null,
    author      varchar(20)  not null,
    public      varchar(30)  not null,
    public_date varchar(10)  not null,
    register    datetime default now(),
    stock       int unsigned not null,
    primary key (isbn),
    constraint fk_book_type_id foreign key (type_id) references book_type (id)
);
# 1 小说
insert into `books`
values ('9787020002207', '红楼梦', 1, '曹雪芹', '人民文学出版社', '2008-07', now(), 100),
       ('9787506371049', '余华长篇小说', 1, '余华', '作家出版社', '2014-01', now(), 100),
       ('9787544253994', '百年孤独', 1, '加西亚·马尔克斯', '南海出版公司', '2011-06', now(), 100),
       ('9787229030933', '三体Ⅲ:死神永生', 1, '刘慈欣', '重庆出版社', '2010-11', now(), 100),
       ('9787536693968', '三体Ⅱ·黑暗森林', 1, '刘慈欣', '重庆出版社', '2008-05', now(), 100),
       ('9787530212004', '平凡的世界', 1, '路遥', '北京十月文艺出版社', '2013-12', now(), 100),
       ('9787544722766', '杀死一只知更鸟', 1, '[美]哈珀·李', '北京十月文艺出版社', '2012-09', now(), 100),
       ('9787544258609', '白夜行', 1, '[日]东野圭吾', '南海出版公司', '2008-09', now(), 100),
       ('9787020090006', '围城', 1, '钱锺书', '人民文学出版社', '1991-02', now(), 100),
       ('9787020008728', '三国演义', 1, '[明]罗贯中', '人民文学出版社', '1973-12', now(), 100);
# 2 历史
insert into books
values ('9787100017664', '国史大纲', 2, '钱穆', '商务印书馆', '1996-06', now(), 100),
       ('9787108042163', '中国青铜时代', 2, '张光直', '新星出版社', '2013-03', now(), 100),
       ('9787511213273', '南明史', 2, '顾诚', '光明日报出版社', '2011-08', now(), 100),
       ('9787101079067', '秦汉魏晋史探微', 2, '田余庆', '中华书局', '2011-06', now(), 100),
       ('9787108009821', '万历十五年', 2, '黄仁宇', '中华书局', '1997-05', now(), 100),
       ('9787513317887', '清代旅蒙商述略', 2, '秋原', '新星出版社', '2015-05', now(), 100),
       ('9787101070743', '春秋左传注', 2, '杨伯峻', '中华书局', '2009-10', now(), 100),
       ('9787108043382', '古代中国考古学', 2, '张光直', '上海人民出版社', '2013-11', now(), 100),
       ('9787208138247', '西周史', 2, '杨宽', '上海人民出版社', '2016-07', now(), 100),
       ('9787208137578', '战国史', 2, '杨宽', '上海人民出版社', '2016-07', now(), 100);
# 3 政治
insert into books
values ('9787010131566', '共产党宣言', 3, '马克思、恩格斯', '人民出版社', '2015-01', now(), 100),
       ('9787108041531', '邓小平时代', 3, '[美]傅高义', '生活·读书·新知三联书店', '2013-01', now(), 100),
       ('9787010009223', '毛泽东选集（第1卷）', 3, '毛泽东', '人民出版社', '1992-04', now(), 100),
       ('9787010009230', '毛泽东选集 第二卷', 3, '毛泽东', '人民出版社', '1991-06', now(), 100),
       ('9787108058102', '自由人的平等政治', 3, '周保松', '生活·读书·新知三联书店', '2017-01', now(), 100),
       ('9787301263525', '政治学通识', 3, '包刚升', '北京大学出版社', '2015-11', now(), 100),
       ('9787301257517', '李光耀观天', 3, '[新加坡]李光耀', '北京大学出版社', '2015-05', now(), 100),
       ('9787100071048', '社会契约论', 3, '[法]卢梭', '商务印书馆', '2011-04', now(), 100),
       ('9787508651903', '论中国', 3, '[美]亨利·基辛格', '中信出版社', '2015-07', now(), 100),
       ('9787549505210', '论自由', 3, '[英]约翰·穆勒', '广西师范大学出版社', '2011-08', now(), 100);
# 4 哲学
insert into books
values ('9787301215692', '中国哲学简史', 4, '冯友兰', '北京大学出版社', '2013-01', now(), 100),
       ('9787501241453', '了凡四训', 4, '一心不二堂', '世界知识出版社', '2011-11', now(), 100),
       ('9787010166834', '实践理性批判', 4, '[德]康德', '人民出版社', '2016-10', now(), 100),
       ('9787010167282', '判断力批判', 4, '康德', '人民出版社', '2017-02', now(), 100),
       ('9787567524989', '僧侣与哲学家', 4, '[法]让-弗朗索瓦·何维勒', '华东师范大学出版社', '2014-09', now(), 100),
       ('9787208121003', '人生的智慧', 4, '[德]叔本华', '上海人民出版社', '2006-10', now(), 100),
       ('9787802113220', '老子德道经', 4, '熊春锦', '中央编译出版社', '2006-10', now(), 100),
       ('9787108057280', '自然权利与历史', 4, '[美]列奥·施特劳斯', '生活·读书·新知三联书店', '2016-07', now(), 100),
       ('9787108050984', '存在与虚无', 4, '[法]萨特', '生活·读书·新知三联书店', '2014-09', now(), 100),
       ('9787536059610', '弟子规', 4, '索达吉堪布', '花城出版社', '2010-05', now(), 100);
# 5 经济
insert into books
values ('9787543224612', '微观经济学：现代观点（第九版）', 5, '[美]哈尔·R.范里安', '格致出版社', '2015-01', now(), 100),
       ('9787301208274', '经济学原理：宏观经济学分册（第6版）', 5, '[美]曼昆', '北京大学出版社', '2012-07', now(), 100),
       ('9787518423323', '从总账到总监：CFO的私房财务笔记', 5, '钱自严', '中国轻工业出版社', '2019-04', now(), 100),
       ('9787010095837', '企业会计准则讲解2010', 5, '财政部会计司编写组', '人民出版社', '2010-12', now(), 100),
       ('9787115253699', '聪明的投资者', 5, '[美]本杰明·格雷厄姆', '人民邮电出版社', '2011-07', now(), 100),
       ('9787302204367', '经济学原理', 5, '[美]曼昆', '清华大学出版社', '2009-06', now(), 100),
       ('9787508653914', '经济解释', 5, '张五常', '中信出版社', '2015-09', now(), 100),
       ('9787208127821', '中国货币史', 5, '彭信威', '上海人民出版社', '2015-04', now(), 100),
       ('9787516176122', '炒股的智慧 (第四版)', 5, '陈江挺', '中国社会科学出版社', '2016-07', now(), 100),
       ('9787300196237', '投资中最简单的事', 5, '邱国鹭', '中国人民大学出版社', '2014-10', now(), 100);
# 6 工程技术
insert into books
values ('9787112116027', '园林景观设计：从概念到形式', 6, '[美]里德', '中国建筑工业出版社', '2010-06', now(), 100),
       ('9787561827116', '建筑：形式、空间和秩序', 6, '程大锦', '天津大学出版社', '2008-09', now(), 100),
       ('9787112044313', '梁思成全集（第七卷）', 6, '梁思成', '中国建筑工业出版社', '2001-04', now(), 100),
       ('9787108033536', '中国建筑史', 6, '梁思成', '生活·读书·新知三联书店', '2011-01', now(), 100),
       ('9787030133083', '晶体管电路设计（上）', 6, '[日]铃木雅臣', '科学出版社', '2004-09', now(), 100),
       ('9787508421643', '水文学原理', 6, '芮孝芳', '水利水电出版社', '2004-08', now(), 100),
       ('9787112013296', '室内设计资料集', 6, '张绮曼、郑曙旸', '中国建筑工业出版社', '1991-06', now(), 100),
       ('9787112003600', '中国古典园林分析', 6, '彭一刚', '中国建筑工业出版社', '1986-12', now(), 100),
       ('9787121068966', '雷达信号处理基础', 6, '[美]Mark A.Richards', '电子工业出版社', '2008-06', now(), 100),
       ('9787115185006', '精通开关电源设计', 6, '[美]Sanjaya Maniktala', '人民邮电出版社', '2008-10', now(), 100);
# 7 心理
insert into books
values ('9787100110457', '存在主义心理治疗', 7, '欧文·D.亚隆', '商务印书馆', '2015-05', now(), 100),
       ('9787300093529', '津巴多普通心理学', 7, '[美]津巴多', '中国人民大学出版社', '2008-07', now(), 100),
       ('9787508095226', '非暴力沟通', 7, '[美]马歇尔·卢森堡著', '华夏出版社', '2018-08', now(), 100),
       ('9787562491330', '精神分析治愈之道', 7, '海因茨·科胡特', '重庆大学出版社', '2016-03', now(), 100),
       ('9787501980529', '生命喜悦的祈祷', 7, '沈妙瑜', '中国轻工业出版社', '2011-04', now(), 100),
       ('9787532745159', '爱的艺术', 7, '[美]艾·弗洛姆', '上海译文出版社', '2008-04', now(), 100),
       ('9787111551447', '红书', 7, '荣格', '机械工业出版社', '2016-12', now(), 100),
       ('9787550284531', '影响力（经典版）', 7, '[美]罗伯特·B.西奥迪尼', '北京联合出版公司', '2016-09', now(), 100),
       ('9787115338914', '心理学', 7, '[美]戴维·迈尔斯', '人民邮电出版社', '2014-01', now(), 100),
       ('9787100097567', '循环提问', 7, '[德]弗里茨·B.西蒙', '商务印书馆', '2013-08', now(), 100);
# 8 互联网
insert into books
values ('9787111544937', '深入理解计算机系统（原书第3版）', 8, '[美]兰德尔 E.布莱恩特', '机械工业出版社', '2016-12', now(), 100),
       ('9787111612728', 'Effective Java中文版', 8, '[美]约书亚·布洛克', '机械工业出版社', '2018-12', now(), 100),
       ('9787115428028', 'Python编程：从入门到实践', 8, '[美]埃里克·马瑟斯', '人民邮电出版社', '2016-07', now(), 100),
       ('9787115390592', 'C Primer Plus(第6版)', 8, '[美]史蒂芬·普拉达', '人民邮电出版社', '2016-04', now(), 100),
       ('9787121155352', 'C++ Primer中文版', 8, 'Stanley B. Lippman', '电子工业出版社', '2013-09', now(), 100),
       ('9787115275790', 'JavaScript高级程序设计', 8, '[美]Nicholas', '人民邮电出版社', '2012-03', now(), 100),
       ('9787115352118', 'UNIX环境高级编程', 8, '[美]W. Richard', '人民邮电出版社', '2014-06', now(), 100),
       ('9787121198854', '高性能MySQL:第3版', 8, 'Baron', '电子工业出版社', '2013-04', now(), 100),
       ('9787111213826', 'Java编程思想（第4版）', 8, '[美]Bruce Eckel', '机械工业出版社', '2007-06', now(), 100),
       ('9787508321752', '深入理解计算机系统', 8, '布赖恩特', '中国电力出版社', '2004-01', now(), 100);
# 9 自然科学
insert into books
values ('9787535732309', '时间简史（插图版）', 9, '[英]史蒂芬·霍金', '湖南科学技术出版社', '2015-04', now(), 100),
       ('9787510040559', '傅立叶分析导论', 9, 'Elias', '世界图书出版公司', '2012-12', now(), 100),
       ('9787508636184', '所罗门王的指环', 9, '[奥地利]康拉德·洛伦茨', '中信出版社', '2012-11', now(), 100),
       ('9787030330154', '细胞生物学精要', 9, '[美]B.艾伯茨', '科学出版社', '2012-03', now(), 100),
       ('9787040186208', '植物学', 9, '马炜梁', '高等教育出版社', '2009-07', now(), 100),
       ('9787312018381', '概率论与数理统计', 9, '陈希孺', '中国科学技术大学出版社', '2009-02', now(), 100),
       ('9787544722841', '几何原本', 9, '[古希腊]欧几里得', '译林出版社', '2011-11', now(), 100),
       ('9787040305722', '统计物理学I', 9, '[俄罗斯]朗道', '高等教育出版社', '2011-04', now(), 100),
       ('9787506291965', '热物理学导论', 9, '施罗德', '世界图书出版公司', '2008-04', now(), 100),
       ('9787506272896', '电动力学导论', 9, 'David J.Griffiths', '世界图书出版公司', '2006-01', now(), 100);

## 借阅信息表
create table `borrow`
(
    id          int unsigned auto_increment,
    uid         int unsigned not null,
    bid         varchar(20)  not null,
    days        int unsigned default 30,
    borrow_date datetime     default now(),
    back_date   datetime     default null,
    primary key (id),
    constraint fk_uid foreign key (uid) references users (id),
    constraint fk_bid foreign key (bid) references books (isbn)
);
insert into borrow
values (null, 1, '9787020002207', 10, now(), null);

## borrow 表添加触发器: 借阅和归还 更新book库存
create trigger `borrow_insert_before_trigger`
    before insert
    on `borrow`
    for each row
begin
    declare _stock int;
    declare msg varchar(20);
    select stock into _stock from books where isbn = NEW.bid;
    if _stock = 0 then
        set msg = '库存不足';
        signal sqlstate 'HY000' set message_text = msg;
    else
        update `books` set stock=stock - 1 where isbn = new.bid;
    end if;
end;

create trigger `borrow_update_after_trigger`
    after update
    on `borrow`
    for each row
begin
    update `books` set stock=stock + 1 where isbn = NEW.bid;
end;
